Terraform plan for __staging__
<details>
  <summary>Plan: 6 to add, 7 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-45FE3B85"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-45FE3B85"
      ~ value          = 170 -> 20
        # (8 unchanged attributes hidden)
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-A4707A72"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-A4707A72"
      ~ value          = 170 -> 20
        # (8 unchanged attributes hidden)
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-F678F1CE"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-F678F1CE"
      ~ value          = 170 -> 20
        # (8 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "0526cbe2-ca32-4cf1-85e4-ece5aa8a925f"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ source_code_hash           = "tK94+/da+/fYULqmF7N/pZI9+KuwS83ZqN0R5x4H1iE=" -> "1+OKeHegir68zibVWQprtvKLPJgNzQdWLevSpHpr7JI="
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_eks.cloudfoundry_service_instance.db will be updated in-place
  ~ resource "cloudfoundry_service_instance" "db" {
        id                             = "956eb618-cb4c-44bc-8048-879097875419"
        name                           = "ssb-eks-db"
      ~ replace_on_service_plan_change = true -> false
        tags                           = [
            "mysql",
        ]
        # (4 unchanged attributes hidden)

      ~ timeouts {
          ~ create = "40m" -> "30m"
          ~ update = "90m" -> "30m"
            # (1 unchanged attribute hidden)
        }
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = true
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-smtp"
      + path                       = "./app-ssb-smtp.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "sK75fPzOF7rv5LlNmMzGvTwO0IrtFqy7sDmiuTQAjnE="
      + space                      = "5edc803e-3376-4788-b72c-a152f11925b0"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_smtp.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "ssb-smtp-gsa-datagov-management-staging"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "5edc803e-3376-4788-b72c-a152f11925b0"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-datagov-management-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "5edc803e-3376-4788-b72c-a152f11925b0"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id                             = (known after apply)
      + name                           = "ssb-smtp-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
      + space                          = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags                           = [
          + "mysql",
        ]

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.broker_smtp.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.broker_smtp.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "ee3956f0-aab7-476e-b556-6013cf5e164f"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solr"
      ~ source_code_hash           = "4zPyUddjS0HqAuptRu2PLMJIkaCjdPaaxMZgueWZsbQ=" -> "Pm7XppCHsmPfIRIydJtvESofhyObkEfv1u+IA7pVYP4="
        # (18 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.broker_solr.cloudfoundry_service_instance.db will be updated in-place
  ~ resource "cloudfoundry_service_instance" "db" {
        id                             = "04375965-b809-4ef5-836a-edacdc7a6ac4"
        name                           = "ssb-solr-db"
      ~ replace_on_service_plan_change = true -> false
        tags                           = [
            "mysql",
        ]
        # (4 unchanged attributes hidden)

      ~ timeouts {
          ~ create = "40m" -> "30m"
          ~ update = "90m" -> "30m"
            # (1 unchanged attribute hidden)
        }
    }

Plan: 6 to add, 7 to change, 0 to destroy.
```
</details>

Plan generated in [plan #100](https://github.com/GSA/datagov-ssb/actions/runs/994854471)